atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
/*
 * This file is part of AtomVM.
 *
 * Copyright 2018,2019 Davide Bettio <davide@uninstall.it>
 * Copyright 2019 Fred Dushin <fred@dushin.net>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#include <sdkconfig.h>
#ifdef CONFIG_AVM_ENABLE_SOCKET_PORT_DRIVER

#include "port.h"

#include <stdbool.h>
#include <string.h>

#include "atom.h"
#include "context.h"
#include "globalcontext.h"
#include "interop.h"
#include "mailbox.h"
#include "port.h"
#include "scheduler.h"
#include "sys.h"
#include "term.h"
#include "utils.h"

#include "esp32_sys.h"
#include "platform_defaultatoms.h"

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
#include <esp_log.h>
#include <lwip/api.h>
#include <lwip/inet.h>
#include <lwip/ip_addr.h>
#pragma GCC diagnostic pop

//#define ENABLE_TRACE 1
#include "trace.h"

#define TAG "socket_driver"

typedef struct SocketListener
{
    EventListener base;
    int32_t process_id;
    avm_int_t buf_size;
} ActiveRecvListener;

// To make thread model explicit, functions that are passed Context *ctx are
// called from this context.
static void socket_driver_init(GlobalContext *global);
static void socket_driver_destroy(GlobalContext *global);
static Context *socket_driver_create_port(GlobalContext *global, term opts);

static NativeHandlerResult socket_consume_mailbox(Context *ctx);

static const char *const tcp_error_atom = "\x9" "tcp_error";

static const char *const netconn_event_internal = ATOM_STR("\x1E", "$atomvm_netconn_event_internal");
static const char *gen_tcp_moniker_atom = ATOM_STR("\xC", "$avm_gen_tcp");
static const char *native_tcp_module_atom = ATOM_STR("\xC", "gen_tcp_inet");
static const char *gen_udp_moniker_atom = ATOM_STR("\xC", "$avm_gen_udp");
static const char *native_udp_module_atom = ATOM_STR("\xC", "gen_udp_inet");

static inline term create_socket_wrapper(term pid, const char *moniker_atom, const char *module_atom, Heap *heap, GlobalContext *global)
{
    term tuple = term_alloc_tuple(3, heap);
    term_put_tuple_element(tuple, 0, globalcontext_make_atom(global, moniker_atom));
    term_put_tuple_element(tuple, 1, pid);
    term_put_tuple_element(tuple, 2, globalcontext_make_atom(global, module_atom));

    return tuple;
}

static inline term create_tcp_socket_wrapper(term pid, Heap *heap, GlobalContext *global)
{
    return create_socket_wrapper(pid, gen_tcp_moniker_atom, native_tcp_module_atom, heap, global);
}

static inline term create_udp_socket_wrapper(term pid, Heap *heap, GlobalContext *global)
{
    return create_socket_wrapper(pid, gen_udp_moniker_atom, native_udp_module_atom, heap, global);
}

uint32_t socket_tuple_to_addr(term addr_tuple)
{
    return ((term_to_int32(term_get_tuple_element(addr_tuple, 0)) & 0xFF) << 24)
        | ((term_to_int32(term_get_tuple_element(addr_tuple, 1)) & 0xFF) << 16)
        | ((term_to_int32(term_get_tuple_element(addr_tuple, 2)) & 0xFF) << 8)
        | (term_to_int32(term_get_tuple_element(addr_tuple, 3)) & 0xFF);
}

static void tuple_to_ip_addr(term address_tuple, ip_addr_t *out_addr)
{
#ifdef CONFIG_LWIP_IPV6
    out_addr->type = IPADDR_TYPE_V4;
    out_addr->u_addr.ip4.addr = htonl(socket_tuple_to_addr(address_tuple));
#else
    out_addr->addr = htonl(socket_tuple_to_addr(address_tuple));
#endif
}

static void socket_fill_ipv4_addr_tuple(term addr_tuple, ip_addr_t *addr)
{
#ifdef CONFIG_LWIP_IPV6
    uint8_t ad1 = ip4_addr1(&(addr->u_addr.ip4));
    uint8_t ad2 = ip4_addr2(&(addr->u_addr.ip4));
    uint8_t ad3 = ip4_addr3(&(addr->u_addr.ip4));
    uint8_t ad4 = ip4_addr4(&(addr->u_addr.ip4));
#else
    uint8_t ad1 = ip4_addr1(addr);
    uint8_t ad2 = ip4_addr2(addr);
    uint8_t ad3 = ip4_addr3(addr);
    uint8_t ad4 = ip4_addr4(addr);
#endif
    term_put_tuple_element(addr_tuple, 0, term_from_int11(ad1));
    term_put_tuple_element(addr_tuple, 1, term_from_int11(ad2));
    term_put_tuple_element(addr_tuple, 2, term_from_int11(ad3));
    term_put_tuple_element(addr_tuple, 3, term_from_int11(ad4));
}

#define SOCKET_INET_ADDR TUPLE_SIZE(4)
static term socket_addr_to_tuple(Heap *heap, ip_addr_t *addr)
{
    term addr_tuple;
#ifdef CONFIG_LWIP_IPV6
    switch (IP_GET_TYPE(addr)) {
        case IPADDR_TYPE_V4: {
            addr_tuple = term_alloc_tuple(4, heap);
            socket_fill_ipv4_addr_tuple(addr_tuple, addr);
            break;
        }
        case IPADDR_TYPE_V6:
            //TODO: implement IPv6
            addr_tuple = term_invalid_term();
            break;

        default:
            addr_tuple = term_invalid_term();
    }
#else
    // When IPv6 is disabled, we only have IPv4 addresses
    addr_tuple = term_alloc_tuple(4, heap);
    socket_fill_ipv4_addr_tuple(addr_tuple, addr);
#endif

    return addr_tuple;
}

enum socket_type
{
    TCPServerSocket,
    TCPClientSocket,
    UDPSocket
};

struct SocketData
{
    struct ListHead sockets_head;
    struct netconn *conn;
    int32_t process_id;
    enum socket_type type;
    int32_t controlling_process_pid;

    int32_t passive_receiver_process_pid;
    uint64_t passive_ref_ticks;

    int avail_bytes;

    uint16_t port;

    size_t buffer;
    bool active : 1;
    bool binary : 1;
    bool read_condition : 1;
    bool connect_in_progress : 1;

    int32_t connect_receiver_process_pid;
    uint64_t connect_ref_ticks;
};

struct TCPClientSocketData
{
    struct SocketData socket_data;
};

struct TCPServerSocketData
{
    struct SocketData socket_data;
    int ready_connections;

    struct ListHead accepters_list_head;
};

