atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
struct TCPServerAccepter
{
    struct ListHead accepter_head;
    int32_t accepting_process_pid;
    uint64_t ref_ticks;
};

struct UDPSocketData
{
    struct SocketData socket_data;
};

// We are queueing netconn with the length because 0 length packets can
// be dropped but > 0 packets cannot because of the race condition with
// accept.
struct NetconnEvent
{
    struct netconn *netconn;
    enum netconn_evt evt;
    u16_t len;
};


struct ReadyConnection
{
    struct ListHead ready_connection_head;
    struct netconn *netconn;
    u16_t len;
};

// `socket_callback` is called from from lwip thread and enqueues the event
// into an event queue, `netconn_events`. It then posts a pointer to
// `netconn_events` as a message in the `event_queue` queue of the ESP32
// platform (declared in sys.c).
// When `sys_poll_events` is called by the scheduler, `receive_events` links
// the event in `event_queue` with `socket_events_handler` as the message is
// a pointer to `netconn_events`, which was registered as the `sender`.
// `socket_events_handler` is passed the `GlobalContext` and performs a lookup
// in the list of sockets to find the proper driver context and sends the event
// to it as an Erlang term using `globalcontext_get_process_lock`.
// The event message is then processed when the scheduler calls the
// native_handler.
//
// This pattern makes sure all accesses to netconn API are serialized. They
// may be called in different scheduler threads, though.

QueueHandle_t netconn_events = NULL;

void IRAM_ATTR socket_callback(struct netconn *netconn, enum netconn_evt evt, u16_t len)
{
    TRACE("socket_callback netconn=%p, evt=%d, len=%d\n", (void *) netconn, evt, len);

    // NETCONN_EVT_RCVPLUS means it's safe to perform a potentially blocking
    // read call once more. However, two data events (with len > 0) may be
    // processed by a single netconn_recv. So we're sending len as well to
    // address the case where len is equal to 0 and netconn_recv will return an
    // error.
    //
    // TCP connect completion is reported through SENDPLUS / ERROR events when
    // using lwIP's non-blocking connect path.
    if (evt == NETCONN_EVT_RCVPLUS || evt == NETCONN_EVT_SENDPLUS || evt == NETCONN_EVT_ERROR) {
        struct NetconnEvent event;
        event.netconn = netconn;
        event.evt = evt;
        event.len = len;

        BaseType_t xHigherPriorityTaskWoken;
        int result = xQueueSendFromISR(netconn_events, &event, &xHigherPriorityTaskWoken);
        if (result != pdTRUE) {
            fprintf(stderr, "socket: failed to enqueue: %i to netconn_events.\n", result);
        }

        result = xQueueSendFromISR(event_queue, &netconn_events, &xHigherPriorityTaskWoken);
        if (result != pdTRUE) {
            fprintf(stderr, "socket: failed to enqueue: %i to event_queue.\n", result);
        }
    }
}

// The scheduler is built in such a way that only one scheduler thread executes
// this function. So we don't need to protect the list of sockets.
EventListener *socket_events_handler(GlobalContext *glb, EventListener *listener)
{
    TRACE("socket_events_handler\n");

    struct ESP32PlatformData *platform = glb->platform_data;

    struct NetconnEvent event;
    while (xQueueReceive(netconn_events, &event, 1) == pdTRUE) {
        TRACE("Got netconn: %p, len = %d\n", (void *) event.netconn, event.len);
        struct SocketData *socket = NULL;
        struct ListHead *socket_head;
        struct ListHead *socket_list = synclist_rdlock(&platform->sockets);
        LIST_FOR_EACH (socket_head, socket_list) {
            struct SocketData *current_socket = GET_LIST_ENTRY(socket_head, struct SocketData, sockets_head);
            if (current_socket->conn == event.netconn) {
                socket = current_socket;
                break;
            }
        }

        if (socket == NULL) {
            if (event.len == 0) {
                // The socket may already be gone
                TRACE("Got event for unknown conn: %p, dropping it as len is 0\n", (void *) event.netconn);
            } else {
                // Add it to ready_connections
                TRACE("Got event for unknown conn: %p, len = %d adding to ready connections list\n", (void *) event.netconn, event.len);
                struct ReadyConnection *ready = (struct ReadyConnection *) malloc(sizeof (struct ReadyConnection));
                ready->netconn = event.netconn;
                ready->len = event.len;
                list_append(&platform->ready_connections, &ready->ready_connection_head);
            }
        }
        synclist_unlock(&platform->sockets);

        if (socket != NULL) {
            BEGIN_WITH_STACK_HEAP(TUPLE_SIZE(3), heap)
            term message = term_alloc_tuple(3, &heap);
            term_put_tuple_element(message, 0, globalcontext_make_atom(glb, netconn_event_internal));
            term_put_tuple_element(message, 1, term_from_int(event.evt));
            term_put_tuple_element(message, 2, term_from_int(event.len));
            globalcontext_send_message(glb, socket->process_id, message);
            END_WITH_STACK_HEAP(heap, glb)
        }
    }
    return listener;
}

void socket_driver_init(GlobalContext *glb)
{
    TRACE("Initializing socket driver\n");

    netconn_events = xQueueCreate(32, sizeof(struct NetconnEvent));
    EventListener *socket_listener = malloc(sizeof(EventListener));

    struct ESP32PlatformData *platform = glb->platform_data;
    platform->socket_listener = socket_listener;
    socket_listener->sender = netconn_events;
    socket_listener->handler = socket_events_handler;
    sys_register_listener(glb, socket_listener);

    synclist_init(&platform->sockets);
    list_init(&platform->ready_connections);

    TRACE("Socket driver init: done\n");
}

void socket_driver_destroy(GlobalContext *glb)
{
    TRACE("Destroying socket driver\n");

    struct ESP32PlatformData *platform = glb->platform_data;
    EventListener *socket_listener = platform->socket_listener;
    sys_unregister_listener(glb, socket_listener);
    vQueueDelete(socket_listener->sender);
    free((void *) socket_listener);

    synclist_destroy(&platform->sockets);

