atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
    TRACE("Socket driver destroy: done\n");
}

static struct ListHead *socket_data_preinit(struct ESP32PlatformData *platform)
{
    TRACE("socket_data_preinit\n");

    return synclist_wrlock(&platform->sockets);
}

static void socket_data_postinit(struct ESP32PlatformData *platform)
{
    TRACE("socket_data_postinit\n");

    synclist_unlock(&platform->sockets);
}

static void socket_data_init(struct SocketData *data, Context *ctx, struct netconn *conn,
    enum socket_type type, struct ListHead *sockets)
{
    TRACE("socket_data_init\n");

    data->type = type;
    data->conn = conn;
    data->process_id = ctx->process_id;
    data->controlling_process_pid = 0;
    data->port = 0;
    data->avail_bytes = 0;
    data->active = true;
    data->binary = true;
    data->read_condition = false;
    data->connect_in_progress = false;
    data->connect_receiver_process_pid = 0;
    data->connect_ref_ticks = 0;
    data->buffer = 512;

    list_append(sockets, &data->sockets_head);
    data->passive_receiver_process_pid = 0;
    data->passive_ref_ticks = 0;

    ctx->platform_data = data;
}

static struct TCPServerSocketData *tcp_server_socket_data_new(Context *ctx, struct netconn *conn,
    struct ListHead *sockets)
{
    struct TCPServerSocketData *tcp_data = malloc(sizeof(struct TCPServerSocketData));
    if (IS_NULL_PTR(tcp_data)) {
        return NULL;
    }
    socket_data_init(&tcp_data->socket_data, ctx, conn, TCPServerSocket, sockets);
    tcp_data->ready_connections = 0;
    list_init(&tcp_data->accepters_list_head);

    return tcp_data;
}

static struct TCPClientSocketData *tcp_client_socket_data_new(Context *ctx, struct netconn *conn,
    struct ListHead *sockets, int32_t controlling_process_pid)
{
    struct TCPClientSocketData *tcp_data = malloc(sizeof(struct TCPClientSocketData));
    if (IS_NULL_PTR(tcp_data)) {
        return NULL;
    }
    socket_data_init(&tcp_data->socket_data, ctx, conn, TCPClientSocket, sockets);
    tcp_data->socket_data.controlling_process_pid = controlling_process_pid;

    return tcp_data;
}

static bool socket_data_is_connecting(const struct SocketData *socket_data)
{
    return !IS_NULL_PTR(socket_data) && socket_data->type == TCPClientSocket && socket_data->connect_in_progress;
}

static void socket_data_clear_connect_reply(struct SocketData *socket_data)
{
    socket_data->connect_in_progress = false;
    socket_data->connect_receiver_process_pid = 0;
    socket_data->connect_ref_ticks = 0;
}

static void socket_data_remove(Context *ctx, struct SocketData *socket_data)
{
    struct ESP32PlatformData *platform = ctx->global->platform_data;
    synclist_remove(&platform->sockets, &socket_data->sockets_head);
}

static void tcp_client_cleanup_connect_failure(Context *ctx, struct TCPClientSocketData *tcp_data)
{
    socket_data_remove(ctx, &tcp_data->socket_data);
    if (!IS_NULL_PTR(tcp_data->socket_data.conn)) {
        if (UNLIKELY(netconn_delete(tcp_data->socket_data.conn) != ERR_OK)) {
            TRACE("tcp_client_cleanup_connect_failure: netconn_delete failed\n");
        }
        tcp_data->socket_data.conn = NULL;
    }
    ctx->platform_data = NULL;
    free(tcp_data);
}

static struct UDPSocketData *udp_socket_data_new(Context *ctx, struct netconn *conn,
    struct ListHead *sockets, int32_t controlling_process_pid)
{
    struct UDPSocketData *udp_data = malloc(sizeof(struct UDPSocketData));
    if (IS_NULL_PTR(udp_data)) {
        return NULL;
    }
    socket_data_init(&udp_data->socket_data, ctx, conn, UDPSocket, sockets);
    udp_data->socket_data.controlling_process_pid = controlling_process_pid;

    return udp_data;
}

// When this method is called, ensure free was called with REPLY_SIZE
#define REPLY_SIZE (TUPLE_SIZE(2) + REF_SIZE)
static void do_send_reply(Context *ctx, term reply, uint64_t ref_ticks, int32_t pid)
{
    GlobalContext *glb = ctx->global;
    term reply_tuple = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(reply_tuple, 0, term_from_ref_ticks(ref_ticks, &ctx->heap));
    term_put_tuple_element(reply_tuple, 1, reply);
    globalcontext_send_message(glb, pid, reply_tuple);
}

// Encode both LWIP errors and some internal errors
// (for example ealready if caller tries to call a passive socket twice)
static term lwip_error_atom(GlobalContext *glb, err_t status)
{
    switch (status) {
        case ERR_MEM:
            return globalcontext_make_atom(glb, ATOM_STR("\x7", "err_mem"));
        case ERR_BUF:
            return globalcontext_make_atom(glb, ATOM_STR("\x7", "err_buf"));
        case ERR_TIMEOUT:
            return globalcontext_make_atom(glb, ATOM_STR("\x9", "etimedout"));
        case ERR_RTE:
            return globalcontext_make_atom(glb, ATOM_STR("\xB", "enetunreach"));
        case ERR_INPROGRESS:
            return globalcontext_make_atom(glb, ATOM_STR("\xB", "einprogress"));
        case ERR_VAL:
            return globalcontext_make_atom(glb, ATOM_STR("\x6", "einval"));
        case ERR_WOULDBLOCK:
            return globalcontext_make_atom(glb, ATOM_STR("\xB", "ewouldblock"));
        case ERR_USE:
            return globalcontext_make_atom(glb, ATOM_STR("\xA", "eaddrinuse"));
        case ERR_ALREADY:
            return globalcontext_make_atom(glb, ATOM_STR("\x8", "ealready"));
        case ERR_ISCONN:
            return globalcontext_make_atom(glb, ATOM_STR("\x7", "eisconn"));
        case ERR_CONN:
            return globalcontext_make_atom(glb, ATOM_STR("\x8", "enotconn"));
        case ERR_IF:
            return globalcontext_make_atom(glb, ATOM_STR("\x8", "enetdown"));
        case ERR_ABRT:
            return globalcontext_make_atom(glb, ATOM_STR("\xC", "econnaborted"));
        case ERR_RST:
            return globalcontext_make_atom(glb, ATOM_STR("\xA", "econnreset"));
        case ERR_CLSD:
            return CLOSED_ATOM;
        case ERR_ARG:
            return BADARG_ATOM;
        default:
            return globalcontext_make_atom(glb, ATOM_STR("\x7", "unknown"));
    }
}

