atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
    // This only retrieves the first chunk of buf
    netbuf_first(buf);
    void *data;
    u16_t data_len;
    status = netbuf_data(buf, &data, &data_len);
    if (UNLIKELY(status != ERR_OK)) {
        TRACE("do_receive_data: netbuf_data error: %i\n", status);
        do_send_socket_error(ctx, status);
        return NativeContinue;
    }
    socket_data->avail_bytes -= data_len;
    socket_data->read_condition = false;

    TRACE("%*s\n", (int) data_len, (char *) data);

    int recv_terms_size;
    if (socket_data->binary) {
        recv_terms_size = term_binary_heap_size(data_len);
    } else {
        recv_terms_size = data_len * 2;
    }

    int tuples_size;
    if (socket_data->active) {
        // tuples_size = 4 (result_tuple size)
        // add 3-tuple for {Moniker :: atom(), Socket :: pid(), Module :: module()}
        tuples_size = TUPLE_SIZE(3) + TUPLE_SIZE(3);
    } else {
        // tuples_size = 3 (ok_tuple size)
        tuples_size = TUPLE_SIZE(2) + REPLY_SIZE;
    }
    if (socket_data->type == UDPSocket) {
        // {<ip_addr>, port, packet}
        tuples_size += SOCKET_INET_ADDR + TUPLE_SIZE(3);
    }
    if (UNLIKELY(memory_ensure_free(ctx, tuples_size + recv_terms_size) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }

    term recv_data;
    if (socket_data->binary) {
        recv_data = term_create_uninitialized_binary(data_len, &ctx->heap, ctx->global);
        memcpy((void *) term_binary_data(recv_data), data, data_len);
    } else {
        recv_data = term_from_string((const uint8_t *) data, data_len, &ctx->heap);
    }
    term recv_term;
    if (socket_data->type == UDPSocket) {
        term addr_term = socket_addr_to_tuple(&ctx->heap, netbuf_fromaddr(buf));
        if (addr_term == term_invalid_term()) {
            TRACE("do_receive_data: socket_addr_to_tuple error\n");
            do_send_socket_error(ctx, ERR_BUF);
            return NativeContinue;
        }
        term port = term_from_int32(netbuf_fromport(buf));
        recv_term = term_alloc_tuple(3, &ctx->heap);
        term_put_tuple_element(recv_term, 0, addr_term);
        term_put_tuple_element(recv_term, 1, port);
        term_put_tuple_element(recv_term, 2, recv_data);
    } else {
        recv_term = recv_data;
    }

    if (netbuf_next(buf) == 0) {
        TRACE("do_receive_data: netbuf error : got more parts\n");
        do_send_socket_error(ctx, ERR_BUF);
        return NativeContinue;
    }

    netbuf_delete(buf);


    if (socket_data->active) {
        term active_tuple = term_alloc_tuple(socket_data->type == TCPClientSocket ? 3 : 5, &ctx->heap);
        term_put_tuple_element(active_tuple, 0, socket_data->type == TCPClientSocket ? TCP_ATOM : UDP_ATOM);
        term socket_pid = term_port_from_local_process_id(ctx->process_id);
        term socket_wrapper =
            socket_data->type == UDPSocket ?
                create_udp_socket_wrapper(socket_pid, &ctx->heap, ctx->global) :
                create_tcp_socket_wrapper(socket_pid, &ctx->heap, ctx->global);
        term_put_tuple_element(active_tuple, 1, socket_wrapper);
        if (socket_data->type == TCPClientSocket) {
            term_put_tuple_element(active_tuple, 2, recv_term);
        } else {
            term_put_tuple_element(active_tuple, 2, term_get_tuple_element(recv_term, 0));
            term_put_tuple_element(active_tuple, 3, term_get_tuple_element(recv_term, 1));
            term_put_tuple_element(active_tuple, 4, recv_data);
        }
        globalcontext_send_message(ctx->global, socket_data->controlling_process_pid, active_tuple);
        TRACE("sent received to active process (pid=%d): ", (int) socket_data->controlling_process_pid);
        #ifdef ENABLE_TRACE
            term_display(stdout, active_tuple, ctx);
        #endif
        TRACE("\n");
    } else {
        term ok_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(ok_tuple, 0, OK_ATOM);
        term_put_tuple_element(ok_tuple, 1, recv_term);
        do_send_passive_reply(ctx, socket_data, ok_tuple);
        TRACE("sent received to passive caller (pid=%d): ", (int) socket_data->passive_receiver_process_pid);
        #ifdef ENABLE_TRACE
            term_display(stdout, ok_tuple, ctx);
        #endif
        TRACE("\n");
    }

    return NativeContinue;
}

static NativeHandlerResult do_data_netconn_event(Context *ctx, int len)
{
    TRACE("do_data_netconn_event\n");
    struct SocketData *socket_data = ctx->platform_data;

    socket_data->avail_bytes += len;

    // We got a message saying that it's safe to call netconn_recv as it will
    // not block yet there is no data.
    if (len == 0) {
        socket_data->read_condition = true;
    }

    // If socket is in passive mode but we don't have any waiting receiver, we
    // should just increment the number of available bytes.
    if (!socket_data->active && socket_data->passive_receiver_process_pid == 0) {
        return NativeContinue;
    }

    // We may have already read the bytes from this event
    if (socket_data->avail_bytes <= 0 && !socket_data->read_condition) {
        return NativeContinue;
    }
    return do_receive_data(ctx);
}

static NativeHandlerResult do_connect_netconn_event(Context *ctx, enum netconn_evt evt, int len)
{
    struct TCPClientSocketData *tcp_data = ctx->platform_data;
    struct SocketData *socket_data = &tcp_data->socket_data;

    if (evt == NETCONN_EVT_RCVPLUS) {
        socket_data->avail_bytes += len;
        if (len == 0) {
            socket_data->read_condition = true;
        }
    }

    if (IS_NULL_PTR(socket_data->conn) || socket_data->conn->state == NETCONN_CONNECT) {
        return NativeContinue;
    }

    int32_t pid = socket_data->connect_receiver_process_pid;
    uint64_t ref_ticks = socket_data->connect_ref_ticks;
    err_t status = netconn_err(socket_data->conn);
    socket_data_clear_connect_reply(socket_data);

    if (UNLIKELY(status != ERR_OK)) {
        tcp_client_cleanup_connect_failure(ctx, tcp_data);
        do_send_error_reply(ctx, status, ref_ticks, pid);
        return NativeContinue;
    }

